Microchip-MPLAB-Harmony/csp/apps/spi/spi_ping_pong_with_dma/firmware/src/packs/ATSAMA5D27_DFP/component/twihs.h
/**
 * \brief Component description for TWIHS
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-01-23T22:42:14Z */
#ifndef _SAMA5D2_TWIHS_COMPONENT_H_
#define _SAMA5D2_TWIHS_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR TWIHS                                        */
/* ************************************************************************** */

/* -------- TWIHS_CR : (TWIHS Offset: 0x00) ( /W 32) Control Register -------- */
#define TWIHS_CR_START_Pos                    _U_(0)                                               /**< (TWIHS_CR) Send a START Condition Position */
#define TWIHS_CR_START_Msk                    (_U_(0x1) << TWIHS_CR_START_Pos)                     /**< (TWIHS_CR) Send a START Condition Mask */
#define TWIHS_CR_START(value)                 (TWIHS_CR_START_Msk & ((value) << TWIHS_CR_START_Pos))
#define TWIHS_CR_STOP_Pos                     _U_(1)                                               /**< (TWIHS_CR) Send a STOP Condition Position */
#define TWIHS_CR_STOP_Msk                     (_U_(0x1) << TWIHS_CR_STOP_Pos)                      /**< (TWIHS_CR) Send a STOP Condition Mask */
#define TWIHS_CR_STOP(value)                  (TWIHS_CR_STOP_Msk & ((value) << TWIHS_CR_STOP_Pos))
#define TWIHS_CR_MSEN_Pos                     _U_(2)                                               /**< (TWIHS_CR) TWIHS Master Mode Enabled Position */
#define TWIHS_CR_MSEN_Msk                     (_U_(0x1) << TWIHS_CR_MSEN_Pos)                      /**< (TWIHS_CR) TWIHS Master Mode Enabled Mask */
#define TWIHS_CR_MSEN(value)                  (TWIHS_CR_MSEN_Msk & ((value) << TWIHS_CR_MSEN_Pos))
#define TWIHS_CR_MSDIS_Pos                    _U_(3)                                               /**< (TWIHS_CR) TWIHS Master Mode Disabled Position */
#define TWIHS_CR_MSDIS_Msk                    (_U_(0x1) << TWIHS_CR_MSDIS_Pos)                     /**< (TWIHS_CR) TWIHS Master Mode Disabled Mask */
#define TWIHS_CR_MSDIS(value)                 (TWIHS_CR_MSDIS_Msk & ((value) << TWIHS_CR_MSDIS_Pos))
#define TWIHS_CR_SVEN_Pos                     _U_(4)                                               /**< (TWIHS_CR) TWIHS Slave Mode Enabled Position */
#define TWIHS_CR_SVEN_Msk                     (_U_(0x1) << TWIHS_CR_SVEN_Pos)                      /**< (TWIHS_CR) TWIHS Slave Mode Enabled Mask */
#define TWIHS_CR_SVEN(value)                  (TWIHS_CR_SVEN_Msk & ((value) << TWIHS_CR_SVEN_Pos))
#define TWIHS_CR_SVDIS_Pos                    _U_(5)                                               /**< (TWIHS_CR) TWIHS Slave Mode Disabled Position */
#define TWIHS_CR_SVDIS_Msk                    (_U_(0x1) << TWIHS_CR_SVDIS_Pos)                     /**< (TWIHS_CR) TWIHS Slave Mode Disabled Mask */
#define TWIHS_CR_SVDIS(value)                 (TWIHS_CR_SVDIS_Msk & ((value) << TWIHS_CR_SVDIS_Pos))
#define TWIHS_CR_QUICK_Pos                    _U_(6)                                               /**< (TWIHS_CR) SMBus Quick Command Position */
#define TWIHS_CR_QUICK_Msk                    (_U_(0x1) << TWIHS_CR_QUICK_Pos)                     /**< (TWIHS_CR) SMBus Quick Command Mask */
#define TWIHS_CR_QUICK(value)                 (TWIHS_CR_QUICK_Msk & ((value) << TWIHS_CR_QUICK_Pos))
#define TWIHS_CR_SWRST_Pos                    _U_(7)                                               /**< (TWIHS_CR) Software Reset Position */
#define TWIHS_CR_SWRST_Msk                    (_U_(0x1) << TWIHS_CR_SWRST_Pos)                     /**< (TWIHS_CR) Software Reset Mask */
#define TWIHS_CR_SWRST(value)                 (TWIHS_CR_SWRST_Msk & ((value) << TWIHS_CR_SWRST_Pos))
#define TWIHS_CR_HSEN_Pos                     _U_(8)                                               /**< (TWIHS_CR) TWIHS High-Speed Mode Enabled Position */
#define TWIHS_CR_HSEN_Msk                     (_U_(0x1) << TWIHS_CR_HSEN_Pos)                      /**< (TWIHS_CR) TWIHS High-Speed Mode Enabled Mask */
#define TWIHS_CR_HSEN(value)                  (TWIHS_CR_HSEN_Msk & ((value) << TWIHS_CR_HSEN_Pos))
#define TWIHS_CR_HSDIS_Pos                    _U_(9)                                               /**< (TWIHS_CR) TWIHS High-Speed Mode Disabled Position */
#define TWIHS_CR_HSDIS_Msk                    (_U_(0x1) << TWIHS_CR_HSDIS_Pos)                     /**< (TWIHS_CR) TWIHS High-Speed Mode Disabled Mask */
#define TWIHS_CR_HSDIS(value)                 (TWIHS_CR_HSDIS_Msk & ((value) << TWIHS_CR_HSDIS_Pos))
#define TWIHS_CR_SMBEN_Pos                    _U_(10)                                              /**< (TWIHS_CR) SMBus Mode Enabled Position */
#define TWIHS_CR_SMBEN_Msk                    (_U_(0x1) << TWIHS_CR_SMBEN_Pos)                     /**< (TWIHS_CR) SMBus Mode Enabled Mask */
#define TWIHS_CR_SMBEN(value)                 (TWIHS_CR_SMBEN_Msk & ((value) << TWIHS_CR_SMBEN_Pos))
#define TWIHS_CR_SMBDIS_Pos                   _U_(11)                                              /**< (TWIHS_CR) SMBus Mode Disabled Position */
#define TWIHS_CR_SMBDIS_Msk                   (_U_(0x1) << TWIHS_CR_SMBDIS_Pos)                    /**< (TWIHS_CR) SMBus Mode Disabled Mask */
#define TWIHS_CR_SMBDIS(value)                (TWIHS_CR_SMBDIS_Msk & ((value) << TWIHS_CR_SMBDIS_Pos))
#define TWIHS_CR_PECEN_Pos                    _U_(12)                                              /**< (TWIHS_CR) Packet Error Checking Enable Position */
#define TWIHS_CR_PECEN_Msk                    (_U_(0x1) << TWIHS_CR_PECEN_Pos)                     /**< (TWIHS_CR) Packet Error Checking Enable Mask */
#define TWIHS_CR_PECEN(value)                 (TWIHS_CR_PECEN_Msk & ((value) << TWIHS_CR_PECEN_Pos))
#define TWIHS_CR_PECDIS_Pos                   _U_(13)                                              /**< (TWIHS_CR) Packet Error Checking Disable Position */
#define TWIHS_CR_PECDIS_Msk                   (_U_(0x1) << TWIHS_CR_PECDIS_Pos)                    /**< (TWIHS_CR) Packet Error Checking Disable Mask */
#define TWIHS_CR_PECDIS(value)                (TWIHS_CR_PECDIS_Msk & ((value) << TWIHS_CR_PECDIS_Pos))
#define TWIHS_CR_PECRQ_Pos                    _U_(14)                                              /**< (TWIHS_CR) PEC Request Position */
#define TWIHS_CR_PECRQ_Msk                    (_U_(0x1) << TWIHS_CR_PECRQ_Pos)                     /**< (TWIHS_CR) PEC Request Mask */
#define TWIHS_CR_PECRQ(value)                 (TWIHS_CR_PECRQ_Msk & ((value) << TWIHS_CR_PECRQ_Pos))
#define TWIHS_CR_CLEAR_Pos                    _U_(15)                                              /**< (TWIHS_CR) Bus CLEAR Command Position */
#define TWIHS_CR_CLEAR_Msk                    (_U_(0x1) << TWIHS_CR_CLEAR_Pos)                     /**< (TWIHS_CR) Bus CLEAR Command Mask */
#define TWIHS_CR_CLEAR(value)                 (TWIHS_CR_CLEAR_Msk & ((value) << TWIHS_CR_CLEAR_Pos))
#define TWIHS_CR_ACMEN_Pos                    _U_(16)                                              /**< (TWIHS_CR) Alternative Command Mode Enable Position */
#define TWIHS_CR_ACMEN_Msk                    (_U_(0x1) << TWIHS_CR_ACMEN_Pos)                     /**< (TWIHS_CR) Alternative Command Mode Enable Mask */
#define TWIHS_CR_ACMEN(value)                 (TWIHS_CR_ACMEN_Msk & ((value) << TWIHS_CR_ACMEN_Pos))
#define TWIHS_CR_ACMDIS_Pos                   _U_(17)                                              /**< (TWIHS_CR) Alternative Command Mode Disable Position */
#define TWIHS_CR_ACMDIS_Msk                   (_U_(0x1) << TWIHS_CR_ACMDIS_Pos)                    /**< (TWIHS_CR) Alternative Command Mode Disable Mask */
#define TWIHS_CR_ACMDIS(value)                (TWIHS_CR_ACMDIS_Msk & ((value) << TWIHS_CR_ACMDIS_Pos))
#define TWIHS_CR_THRCLR_Pos                   _U_(24)                                              /**< (TWIHS_CR) Transmit Holding Register Clear Position */
#define TWIHS_CR_THRCLR_Msk                   (_U_(0x1) << TWIHS_CR_THRCLR_Pos)                    /**< (TWIHS_CR) Transmit Holding Register Clear Mask */
#define TWIHS_CR_THRCLR(value)                (TWIHS_CR_THRCLR_Msk & ((value) << TWIHS_CR_THRCLR_Pos))
#define TWIHS_CR_LOCKCLR_Pos                  _U_(26)                                              /**< (TWIHS_CR) Lock Clear Position */
#define TWIHS_CR_LOCKCLR_Msk                  (_U_(0x1) << TWIHS_CR_LOCKCLR_Pos)                   /**< (TWIHS_CR) Lock Clear Mask */
#define TWIHS_CR_LOCKCLR(value)               (TWIHS_CR_LOCKCLR_Msk & ((value) << TWIHS_CR_LOCKCLR_Pos))
#define TWIHS_CR_FIFOEN_Pos                   _U_(28)                                              /**< (TWIHS_CR) FIFO Enable Position */
#define TWIHS_CR_FIFOEN_Msk                   (_U_(0x1) << TWIHS_CR_FIFOEN_Pos)                    /**< (TWIHS_CR) FIFO Enable Mask */
#define TWIHS_CR_FIFOEN(value)                (TWIHS_CR_FIFOEN_Msk & ((value) << TWIHS_CR_FIFOEN_Pos))
#define TWIHS_CR_FIFODIS_Pos                  _U_(29)                                              /**< (TWIHS_CR) FIFO Disable Position */
#define TWIHS_CR_FIFODIS_Msk                  (_U_(0x1) << TWIHS_CR_FIFODIS_Pos)                   /**< (TWIHS_CR) FIFO Disable Mask */
#define TWIHS_CR_FIFODIS(value)               (TWIHS_CR_FIFODIS_Msk & ((value) << TWIHS_CR_FIFODIS_Pos))
#define TWIHS_CR_Msk                          _U_(0x3503FFFF)                                      /**< (TWIHS_CR) Register Mask  */

/* FIFO_ENABLED mode */
#define TWIHS_CR_FIFO_ENABLED_START_Pos       _U_(0)                                               /**< (TWIHS_CR) Send a START Condition Position */
#define TWIHS_CR_FIFO_ENABLED_START_Msk       (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_START_Pos)        /**< (TWIHS_CR) Send a START Condition Mask */
#define TWIHS_CR_FIFO_ENABLED_START(value)    (TWIHS_CR_FIFO_ENABLED_START_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_START_Pos))
#define TWIHS_CR_FIFO_ENABLED_STOP_Pos        _U_(1)                                               /**< (TWIHS_CR) Send a STOP Condition Position */
#define TWIHS_CR_FIFO_ENABLED_STOP_Msk        (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_STOP_Pos)         /**< (TWIHS_CR) Send a STOP Condition Mask */
#define TWIHS_CR_FIFO_ENABLED_STOP(value)     (TWIHS_CR_FIFO_ENABLED_STOP_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_STOP_Pos))
#define TWIHS_CR_FIFO_ENABLED_MSEN_Pos        _U_(2)                                               /**< (TWIHS_CR) TWIHS Master Mode Enabled Position */
#define TWIHS_CR_FIFO_ENABLED_MSEN_Msk        (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_MSEN_Pos)         /**< (TWIHS_CR) TWIHS Master Mode Enabled Mask */
#define TWIHS_CR_FIFO_ENABLED_MSEN(value)     (TWIHS_CR_FIFO_ENABLED_MSEN_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_MSEN_Pos))
#define TWIHS_CR_FIFO_ENABLED_MSDIS_Pos       _U_(3)                                               /**< (TWIHS_CR) TWIHS Master Mode Disabled Position */
#define TWIHS_CR_FIFO_ENABLED_MSDIS_Msk       (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_MSDIS_Pos)        /**< (TWIHS_CR) TWIHS Master Mode Disabled Mask */
#define TWIHS_CR_FIFO_ENABLED_MSDIS(value)    (TWIHS_CR_FIFO_ENABLED_MSDIS_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_MSDIS_Pos))
#define TWIHS_CR_FIFO_ENABLED_SVEN_Pos        _U_(4)                                               /**< (TWIHS_CR) TWIHS Slave Mode Enabled Position */
#define TWIHS_CR_FIFO_ENABLED_SVEN_Msk        (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_SVEN_Pos)         /**< (TWIHS_CR) TWIHS Slave Mode Enabled Mask */
#define TWIHS_CR_FIFO_ENABLED_SVEN(value)     (TWIHS_CR_FIFO_ENABLED_SVEN_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_SVEN_Pos))
#define TWIHS_CR_FIFO_ENABLED_SVDIS_Pos       _U_(5)                                               /**< (TWIHS_CR) TWIHS Slave Mode Disabled Position */
#define TWIHS_CR_FIFO_ENABLED_SVDIS_Msk       (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_SVDIS_Pos)        /**< (TWIHS_CR) TWIHS Slave Mode Disabled Mask */
#define TWIHS_CR_FIFO_ENABLED_SVDIS(value)    (TWIHS_CR_FIFO_ENABLED_SVDIS_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_SVDIS_Pos))
#define TWIHS_CR_FIFO_ENABLED_QUICK_Pos       _U_(6)                                               /**< (TWIHS_CR) SMBus Quick Command Position */
#define TWIHS_CR_FIFO_ENABLED_QUICK_Msk       (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_QUICK_Pos)        /**< (TWIHS_CR) SMBus Quick Command Mask */
#define TWIHS_CR_FIFO_ENABLED_QUICK(value)    (TWIHS_CR_FIFO_ENABLED_QUICK_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_QUICK_Pos))
#define TWIHS_CR_FIFO_ENABLED_SWRST_Pos       _U_(7)                                               /**< (TWIHS_CR) Software Reset Position */
#define TWIHS_CR_FIFO_ENABLED_SWRST_Msk       (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_SWRST_Pos)        /**< (TWIHS_CR) Software Reset Mask */
#define TWIHS_CR_FIFO_ENABLED_SWRST(value)    (TWIHS_CR_FIFO_ENABLED_SWRST_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_SWRST_Pos))
#define TWIHS_CR_FIFO_ENABLED_HSEN_Pos        _U_(8)                                               /**< (TWIHS_CR) TWIHS High-Speed Mode Enabled Position */
#define TWIHS_CR_FIFO_ENABLED_HSEN_Msk        (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_HSEN_Pos)         /**< (TWIHS_CR) TWIHS High-Speed Mode Enabled Mask */
#define TWIHS_CR_FIFO_ENABLED_HSEN(value)     (TWIHS_CR_FIFO_ENABLED_HSEN_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_HSEN_Pos))
#define TWIHS_CR_FIFO_ENABLED_HSDIS_Pos       _U_(9)                                               /**< (TWIHS_CR) TWIHS High-Speed Mode Disabled Position */
#define TWIHS_CR_FIFO_ENABLED_HSDIS_Msk       (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_HSDIS_Pos)        /**< (TWIHS_CR) TWIHS High-Speed Mode Disabled Mask */
#define TWIHS_CR_FIFO_ENABLED_HSDIS(value)    (TWIHS_CR_FIFO_ENABLED_HSDIS_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_HSDIS_Pos))
#define TWIHS_CR_FIFO_ENABLED_SMBEN_Pos       _U_(10)                                              /**< (TWIHS_CR) SMBus Mode Enabled Position */
#define TWIHS_CR_FIFO_ENABLED_SMBEN_Msk       (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_SMBEN_Pos)        /**< (TWIHS_CR) SMBus Mode Enabled Mask */
#define TWIHS_CR_FIFO_ENABLED_SMBEN(value)    (TWIHS_CR_FIFO_ENABLED_SMBEN_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_SMBEN_Pos))
#define TWIHS_CR_FIFO_ENABLED_SMBDIS_Pos      _U_(11)                                              /**< (TWIHS_CR) SMBus Mode Disabled Position */
#define TWIHS_CR_FIFO_ENABLED_SMBDIS_Msk      (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_SMBDIS_Pos)       /**< (TWIHS_CR) SMBus Mode Disabled Mask */
#define TWIHS_CR_FIFO_ENABLED_SMBDIS(value)   (TWIHS_CR_FIFO_ENABLED_SMBDIS_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_SMBDIS_Pos))
#define TWIHS_CR_FIFO_ENABLED_PECEN_Pos       _U_(12)                                              /**< (TWIHS_CR) Packet Error Checking Enable Position */
#define TWIHS_CR_FIFO_ENABLED_PECEN_Msk       (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_PECEN_Pos)        /**< (TWIHS_CR) Packet Error Checking Enable Mask */
#define TWIHS_CR_FIFO_ENABLED_PECEN(value)    (TWIHS_CR_FIFO_ENABLED_PECEN_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_PECEN_Pos))
#define TWIHS_CR_FIFO_ENABLED_PECDIS_Pos      _U_(13)                                              /**< (TWIHS_CR) Packet Error Checking Disable Position */
#define TWIHS_CR_FIFO_ENABLED_PECDIS_Msk      (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_PECDIS_Pos)       /**< (TWIHS_CR) Packet Error Checking Disable Mask */
#define TWIHS_CR_FIFO_ENABLED_PECDIS(value)   (TWIHS_CR_FIFO_ENABLED_PECDIS_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_PECDIS_Pos))
#define TWIHS_CR_FIFO_ENABLED_PECRQ_Pos       _U_(14)                                              /**< (TWIHS_CR) PEC Request Position */
#define TWIHS_CR_FIFO_ENABLED_PECRQ_Msk       (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_PECRQ_Pos)        /**< (TWIHS_CR) PEC Request Mask */
#define TWIHS_CR_FIFO_ENABLED_PECRQ(value)    (TWIHS_CR_FIFO_ENABLED_PECRQ_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_PECRQ_Pos))
#define TWIHS_CR_FIFO_ENABLED_CLEAR_Pos       _U_(15)                                              /**< (TWIHS_CR) Bus CLEAR Command Position */
#define TWIHS_CR_FIFO_ENABLED_CLEAR_Msk       (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_CLEAR_Pos)        /**< (TWIHS_CR) Bus CLEAR Command Mask */
#define TWIHS_CR_FIFO_ENABLED_CLEAR(value)    (TWIHS_CR_FIFO_ENABLED_CLEAR_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_CLEAR_Pos))
#define TWIHS_CR_FIFO_ENABLED_ACMEN_Pos       _U_(16)                                              /**< (TWIHS_CR) Alternative Command Mode Enable Position */
#define TWIHS_CR_FIFO_ENABLED_ACMEN_Msk       (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_ACMEN_Pos)        /**< (TWIHS_CR) Alternative Command Mode Enable Mask */
#define TWIHS_CR_FIFO_ENABLED_ACMEN(value)    (TWIHS_CR_FIFO_ENABLED_ACMEN_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_ACMEN_Pos))
#define TWIHS_CR_FIFO_ENABLED_ACMDIS_Pos      _U_(17)                                              /**< (TWIHS_CR) Alternative Command Mode Disable Position */
#define TWIHS_CR_FIFO_ENABLED_ACMDIS_Msk      (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_ACMDIS_Pos)       /**< (TWIHS_CR) Alternative Command Mode Disable Mask */
#define TWIHS_CR_FIFO_ENABLED_ACMDIS(value)   (TWIHS_CR_FIFO_ENABLED_ACMDIS_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_ACMDIS_Pos))
#define TWIHS_CR_FIFO_ENABLED_TXFCLR_Pos      _U_(24)                                              /**< (TWIHS_CR) Transmit FIFO Clear Position */
#define TWIHS_CR_FIFO_ENABLED_TXFCLR_Msk      (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_TXFCLR_Pos)       /**< (TWIHS_CR) Transmit FIFO Clear Mask */
#define TWIHS_CR_FIFO_ENABLED_TXFCLR(value)   (TWIHS_CR_FIFO_ENABLED_TXFCLR_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_TXFCLR_Pos))
#define TWIHS_CR_FIFO_ENABLED_RXFCLR_Pos      _U_(25)                                              /**< (TWIHS_CR) Receive FIFO Clear Position */
#define TWIHS_CR_FIFO_ENABLED_RXFCLR_Msk      (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_RXFCLR_Pos)       /**< (TWIHS_CR) Receive FIFO Clear Mask */
#define TWIHS_CR_FIFO_ENABLED_RXFCLR(value)   (TWIHS_CR_FIFO_ENABLED_RXFCLR_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_RXFCLR_Pos))
#define TWIHS_CR_FIFO_ENABLED_TXFLCLR_Pos     _U_(26)                                              /**< (TWIHS_CR) Transmit FIFO Lock CLEAR Position */
#define TWIHS_CR_FIFO_ENABLED_TXFLCLR_Msk     (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_TXFLCLR_Pos)      /**< (TWIHS_CR) Transmit FIFO Lock CLEAR Mask */
#define TWIHS_CR_FIFO_ENABLED_TXFLCLR(value)  (TWIHS_CR_FIFO_ENABLED_TXFLCLR_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_TXFLCLR_Pos))
#define TWIHS_CR_FIFO_ENABLED_FIFOEN_Pos      _U_(28)                                              /**< (TWIHS_CR) FIFO Enable Position */
#define TWIHS_CR_FIFO_ENABLED_FIFOEN_Msk      (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_FIFOEN_Pos)       /**< (TWIHS_CR) FIFO Enable Mask */
#define TWIHS_CR_FIFO_ENABLED_FIFOEN(value)   (TWIHS_CR_FIFO_ENABLED_FIFOEN_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_FIFOEN_Pos))
#define TWIHS_CR_FIFO_ENABLED_FIFODIS_Pos     _U_(29)                                              /**< (TWIHS_CR) FIFO Disable Position */
#define TWIHS_CR_FIFO_ENABLED_FIFODIS_Msk     (_U_(0x1) << TWIHS_CR_FIFO_ENABLED_FIFODIS_Pos)      /**< (TWIHS_CR) FIFO Disable Mask */
#define TWIHS_CR_FIFO_ENABLED_FIFODIS(value)  (TWIHS_CR_FIFO_ENABLED_FIFODIS_Msk & ((value) << TWIHS_CR_FIFO_ENABLED_FIFODIS_Pos))
#define TWIHS_CR_FIFO_ENABLED_Msk             _U_(0x3703FFFF)                                       /**< (TWIHS_CR_FIFO_ENABLED) Register Mask  */


