Microchip-MPLAB-Harmony/csp/apps/spi/spi_ping_pong_with_dma/firmware/src/packs/ATSAMA5D27_DFP/component/twihs.h
/* -------- TWIHS_RHR : (TWIHS Offset: 0x30) ( R/ 32) Receive Holding Register -------- */
#define TWIHS_RHR_RXDATA_Pos                  _U_(0)                                               /**< (TWIHS_RHR) Master or Slave Receive Holding Data Position */
#define TWIHS_RHR_RXDATA_Msk                  (_U_(0xFF) << TWIHS_RHR_RXDATA_Pos)                  /**< (TWIHS_RHR) Master or Slave Receive Holding Data Mask */
#define TWIHS_RHR_RXDATA(value)               (TWIHS_RHR_RXDATA_Msk & ((value) << TWIHS_RHR_RXDATA_Pos))
#define TWIHS_RHR_Msk                         _U_(0x000000FF)                                      /**< (TWIHS_RHR) Register Mask  */

/* FIFO_ENABLED mode */
#define TWIHS_RHR_FIFO_ENABLED_RXDATA0_Pos    _U_(0)                                               /**< (TWIHS_RHR) Master or Slave Receive Holding Data 0 Position */
#define TWIHS_RHR_FIFO_ENABLED_RXDATA0_Msk    (_U_(0xFF) << TWIHS_RHR_FIFO_ENABLED_RXDATA0_Pos)    /**< (TWIHS_RHR) Master or Slave Receive Holding Data 0 Mask */
#define TWIHS_RHR_FIFO_ENABLED_RXDATA0(value) (TWIHS_RHR_FIFO_ENABLED_RXDATA0_Msk & ((value) << TWIHS_RHR_FIFO_ENABLED_RXDATA0_Pos))
#define TWIHS_RHR_FIFO_ENABLED_RXDATA1_Pos    _U_(8)                                               /**< (TWIHS_RHR) Master or Slave Receive Holding Data 1 Position */
#define TWIHS_RHR_FIFO_ENABLED_RXDATA1_Msk    (_U_(0xFF) << TWIHS_RHR_FIFO_ENABLED_RXDATA1_Pos)    /**< (TWIHS_RHR) Master or Slave Receive Holding Data 1 Mask */
#define TWIHS_RHR_FIFO_ENABLED_RXDATA1(value) (TWIHS_RHR_FIFO_ENABLED_RXDATA1_Msk & ((value) << TWIHS_RHR_FIFO_ENABLED_RXDATA1_Pos))
#define TWIHS_RHR_FIFO_ENABLED_RXDATA2_Pos    _U_(16)                                              /**< (TWIHS_RHR) Master or Slave Receive Holding Data 2 Position */
#define TWIHS_RHR_FIFO_ENABLED_RXDATA2_Msk    (_U_(0xFF) << TWIHS_RHR_FIFO_ENABLED_RXDATA2_Pos)    /**< (TWIHS_RHR) Master or Slave Receive Holding Data 2 Mask */
#define TWIHS_RHR_FIFO_ENABLED_RXDATA2(value) (TWIHS_RHR_FIFO_ENABLED_RXDATA2_Msk & ((value) << TWIHS_RHR_FIFO_ENABLED_RXDATA2_Pos))
#define TWIHS_RHR_FIFO_ENABLED_RXDATA3_Pos    _U_(24)                                              /**< (TWIHS_RHR) Master or Slave Receive Holding Data 3 Position */
#define TWIHS_RHR_FIFO_ENABLED_RXDATA3_Msk    (_U_(0xFF) << TWIHS_RHR_FIFO_ENABLED_RXDATA3_Pos)    /**< (TWIHS_RHR) Master or Slave Receive Holding Data 3 Mask */
#define TWIHS_RHR_FIFO_ENABLED_RXDATA3(value) (TWIHS_RHR_FIFO_ENABLED_RXDATA3_Msk & ((value) << TWIHS_RHR_FIFO_ENABLED_RXDATA3_Pos))
#define TWIHS_RHR_FIFO_ENABLED_Msk            _U_(0xFFFFFFFF)                                       /**< (TWIHS_RHR_FIFO_ENABLED) Register Mask  */


/* -------- TWIHS_THR : (TWIHS Offset: 0x34) ( /W 32) Transmit Holding Register -------- */
#define TWIHS_THR_TXDATA_Pos                  _U_(0)                                               /**< (TWIHS_THR) Master or Slave Transmit Holding Data Position */
#define TWIHS_THR_TXDATA_Msk                  (_U_(0xFF) << TWIHS_THR_TXDATA_Pos)                  /**< (TWIHS_THR) Master or Slave Transmit Holding Data Mask */
#define TWIHS_THR_TXDATA(value)               (TWIHS_THR_TXDATA_Msk & ((value) << TWIHS_THR_TXDATA_Pos))
#define TWIHS_THR_Msk                         _U_(0x000000FF)                                      /**< (TWIHS_THR) Register Mask  */

/* FIFO_ENABLED mode */
#define TWIHS_THR_FIFO_ENABLED_TXDATA0_Pos    _U_(0)                                               /**< (TWIHS_THR) Master or Slave Transmit Holding Data 02 Position */
#define TWIHS_THR_FIFO_ENABLED_TXDATA0_Msk    (_U_(0xFF) << TWIHS_THR_FIFO_ENABLED_TXDATA0_Pos)    /**< (TWIHS_THR) Master or Slave Transmit Holding Data 02 Mask */
#define TWIHS_THR_FIFO_ENABLED_TXDATA0(value) (TWIHS_THR_FIFO_ENABLED_TXDATA0_Msk & ((value) << TWIHS_THR_FIFO_ENABLED_TXDATA0_Pos))
#define TWIHS_THR_FIFO_ENABLED_TXDATA1_Pos    _U_(8)                                               /**< (TWIHS_THR) Master or Slave Transmit Holding Data 1 Position */
#define TWIHS_THR_FIFO_ENABLED_TXDATA1_Msk    (_U_(0xFF) << TWIHS_THR_FIFO_ENABLED_TXDATA1_Pos)    /**< (TWIHS_THR) Master or Slave Transmit Holding Data 1 Mask */
#define TWIHS_THR_FIFO_ENABLED_TXDATA1(value) (TWIHS_THR_FIFO_ENABLED_TXDATA1_Msk & ((value) << TWIHS_THR_FIFO_ENABLED_TXDATA1_Pos))
#define TWIHS_THR_FIFO_ENABLED_TXDATA2_Pos    _U_(16)                                              /**< (TWIHS_THR) Master or Slave Transmit Holding Data 2 Position */
#define TWIHS_THR_FIFO_ENABLED_TXDATA2_Msk    (_U_(0xFF) << TWIHS_THR_FIFO_ENABLED_TXDATA2_Pos)    /**< (TWIHS_THR) Master or Slave Transmit Holding Data 2 Mask */
#define TWIHS_THR_FIFO_ENABLED_TXDATA2(value) (TWIHS_THR_FIFO_ENABLED_TXDATA2_Msk & ((value) << TWIHS_THR_FIFO_ENABLED_TXDATA2_Pos))
#define TWIHS_THR_FIFO_ENABLED_TXDATA3_Pos    _U_(24)                                              /**< (TWIHS_THR) Master or Slave Transmit Holding Data 3 Position */
#define TWIHS_THR_FIFO_ENABLED_TXDATA3_Msk    (_U_(0xFF) << TWIHS_THR_FIFO_ENABLED_TXDATA3_Pos)    /**< (TWIHS_THR) Master or Slave Transmit Holding Data 3 Mask */
#define TWIHS_THR_FIFO_ENABLED_TXDATA3(value) (TWIHS_THR_FIFO_ENABLED_TXDATA3_Msk & ((value) << TWIHS_THR_FIFO_ENABLED_TXDATA3_Pos))
#define TWIHS_THR_FIFO_ENABLED_Msk            _U_(0xFFFFFFFF)                                       /**< (TWIHS_THR_FIFO_ENABLED) Register Mask  */


/* -------- TWIHS_SMBTR : (TWIHS Offset: 0x38) (R/W 32) SMBus Timing Register -------- */
#define TWIHS_SMBTR_PRESC_Pos                 _U_(0)                                               /**< (TWIHS_SMBTR) SMBus Clock Prescaler Position */
#define TWIHS_SMBTR_PRESC_Msk                 (_U_(0xF) << TWIHS_SMBTR_PRESC_Pos)                  /**< (TWIHS_SMBTR) SMBus Clock Prescaler Mask */
#define TWIHS_SMBTR_PRESC(value)              (TWIHS_SMBTR_PRESC_Msk & ((value) << TWIHS_SMBTR_PRESC_Pos))
#define TWIHS_SMBTR_TLOWS_Pos                 _U_(8)                                               /**< (TWIHS_SMBTR) Slave Clock Stretch Maximum Cycles Position */
#define TWIHS_SMBTR_TLOWS_Msk                 (_U_(0xFF) << TWIHS_SMBTR_TLOWS_Pos)                 /**< (TWIHS_SMBTR) Slave Clock Stretch Maximum Cycles Mask */
#define TWIHS_SMBTR_TLOWS(value)              (TWIHS_SMBTR_TLOWS_Msk & ((value) << TWIHS_SMBTR_TLOWS_Pos))
#define TWIHS_SMBTR_TLOWM_Pos                 _U_(16)                                              /**< (TWIHS_SMBTR) Master Clock Stretch Maximum Cycles Position */
#define TWIHS_SMBTR_TLOWM_Msk                 (_U_(0xFF) << TWIHS_SMBTR_TLOWM_Pos)                 /**< (TWIHS_SMBTR) Master Clock Stretch Maximum Cycles Mask */
#define TWIHS_SMBTR_TLOWM(value)              (TWIHS_SMBTR_TLOWM_Msk & ((value) << TWIHS_SMBTR_TLOWM_Pos))
#define TWIHS_SMBTR_THMAX_Pos                 _U_(24)                                              /**< (TWIHS_SMBTR) Clock High Maximum Cycles Position */
#define TWIHS_SMBTR_THMAX_Msk                 (_U_(0xFF) << TWIHS_SMBTR_THMAX_Pos)                 /**< (TWIHS_SMBTR) Clock High Maximum Cycles Mask */
#define TWIHS_SMBTR_THMAX(value)              (TWIHS_SMBTR_THMAX_Msk & ((value) << TWIHS_SMBTR_THMAX_Pos))
#define TWIHS_SMBTR_Msk                       _U_(0xFFFFFF0F)                                      /**< (TWIHS_SMBTR) Register Mask  */


/* -------- TWIHS_ACR : (TWIHS Offset: 0x40) (R/W 32) Alternative Command Register -------- */
#define TWIHS_ACR_DATAL_Pos                   _U_(0)                                               /**< (TWIHS_ACR) Data Length Position */
#define TWIHS_ACR_DATAL_Msk                   (_U_(0xFF) << TWIHS_ACR_DATAL_Pos)                   /**< (TWIHS_ACR) Data Length Mask */
#define TWIHS_ACR_DATAL(value)                (TWIHS_ACR_DATAL_Msk & ((value) << TWIHS_ACR_DATAL_Pos))
#define TWIHS_ACR_DIR_Pos                     _U_(8)                                               /**< (TWIHS_ACR) Transfer Direction Position */
#define TWIHS_ACR_DIR_Msk                     (_U_(0x1) << TWIHS_ACR_DIR_Pos)                      /**< (TWIHS_ACR) Transfer Direction Mask */
#define TWIHS_ACR_DIR(value)                  (TWIHS_ACR_DIR_Msk & ((value) << TWIHS_ACR_DIR_Pos))
#define TWIHS_ACR_PEC_Pos                     _U_(9)                                               /**< (TWIHS_ACR) PEC Request (SMBus Mode only) Position */
#define TWIHS_ACR_PEC_Msk                     (_U_(0x1) << TWIHS_ACR_PEC_Pos)                      /**< (TWIHS_ACR) PEC Request (SMBus Mode only) Mask */
#define TWIHS_ACR_PEC(value)                  (TWIHS_ACR_PEC_Msk & ((value) << TWIHS_ACR_PEC_Pos))
#define TWIHS_ACR_NDATAL_Pos                  _U_(16)                                              /**< (TWIHS_ACR) Next Data Length Position */
#define TWIHS_ACR_NDATAL_Msk                  (_U_(0xFF) << TWIHS_ACR_NDATAL_Pos)                  /**< (TWIHS_ACR) Next Data Length Mask */
#define TWIHS_ACR_NDATAL(value)               (TWIHS_ACR_NDATAL_Msk & ((value) << TWIHS_ACR_NDATAL_Pos))
#define TWIHS_ACR_NDIR_Pos                    _U_(24)                                              /**< (TWIHS_ACR) Next Transfer Direction Position */
#define TWIHS_ACR_NDIR_Msk                    (_U_(0x1) << TWIHS_ACR_NDIR_Pos)                     /**< (TWIHS_ACR) Next Transfer Direction Mask */
#define TWIHS_ACR_NDIR(value)                 (TWIHS_ACR_NDIR_Msk & ((value) << TWIHS_ACR_NDIR_Pos))
#define TWIHS_ACR_NPEC_Pos                    _U_(25)                                              /**< (TWIHS_ACR) Next PEC Request (SMBus Mode only) Position */
#define TWIHS_ACR_NPEC_Msk                    (_U_(0x1) << TWIHS_ACR_NPEC_Pos)                     /**< (TWIHS_ACR) Next PEC Request (SMBus Mode only) Mask */
#define TWIHS_ACR_NPEC(value)                 (TWIHS_ACR_NPEC_Msk & ((value) << TWIHS_ACR_NPEC_Pos))
#define TWIHS_ACR_Msk                         _U_(0x03FF03FF)                                      /**< (TWIHS_ACR) Register Mask  */


/* -------- TWIHS_FILTR : (TWIHS Offset: 0x44) (R/W 32) Filter Register -------- */
#define TWIHS_FILTR_FILT_Pos                  _U_(0)                                               /**< (TWIHS_FILTR) RX Digital Filter Position */
#define TWIHS_FILTR_FILT_Msk                  (_U_(0x1) << TWIHS_FILTR_FILT_Pos)                   /**< (TWIHS_FILTR) RX Digital Filter Mask */
#define TWIHS_FILTR_FILT(value)               (TWIHS_FILTR_FILT_Msk & ((value) << TWIHS_FILTR_FILT_Pos))
#define TWIHS_FILTR_PADFEN_Pos                _U_(1)                                               /**< (TWIHS_FILTR) PAD Filter Enable Position */
#define TWIHS_FILTR_PADFEN_Msk                (_U_(0x1) << TWIHS_FILTR_PADFEN_Pos)                 /**< (TWIHS_FILTR) PAD Filter Enable Mask */
#define TWIHS_FILTR_PADFEN(value)             (TWIHS_FILTR_PADFEN_Msk & ((value) << TWIHS_FILTR_PADFEN_Pos))
#define TWIHS_FILTR_PADFCFG_Pos               _U_(2)                                               /**< (TWIHS_FILTR) PAD Filter Config Position */
#define TWIHS_FILTR_PADFCFG_Msk               (_U_(0x1) << TWIHS_FILTR_PADFCFG_Pos)                /**< (TWIHS_FILTR) PAD Filter Config Mask */
#define TWIHS_FILTR_PADFCFG(value)            (TWIHS_FILTR_PADFCFG_Msk & ((value) << TWIHS_FILTR_PADFCFG_Pos))
#define TWIHS_FILTR_THRES_Pos                 _U_(8)                                               /**< (TWIHS_FILTR) Digital Filter Threshold Position */
#define TWIHS_FILTR_THRES_Msk                 (_U_(0x7) << TWIHS_FILTR_THRES_Pos)                  /**< (TWIHS_FILTR) Digital Filter Threshold Mask */
#define TWIHS_FILTR_THRES(value)              (TWIHS_FILTR_THRES_Msk & ((value) << TWIHS_FILTR_THRES_Pos))
#define TWIHS_FILTR_Msk                       _U_(0x00000707)                                      /**< (TWIHS_FILTR) Register Mask  */


/* -------- TWIHS_SWMR : (TWIHS Offset: 0x4C) (R/W 32) SleepWalking Matching Register -------- */
#define TWIHS_SWMR_SADR1_Pos                  _U_(0)                                               /**< (TWIHS_SWMR) Slave Address 1 Position */
#define TWIHS_SWMR_SADR1_Msk                  (_U_(0x7F) << TWIHS_SWMR_SADR1_Pos)                  /**< (TWIHS_SWMR) Slave Address 1 Mask */
#define TWIHS_SWMR_SADR1(value)               (TWIHS_SWMR_SADR1_Msk & ((value) << TWIHS_SWMR_SADR1_Pos))
#define TWIHS_SWMR_SADR2_Pos                  _U_(8)                                               /**< (TWIHS_SWMR) Slave Address 2 Position */
#define TWIHS_SWMR_SADR2_Msk                  (_U_(0x7F) << TWIHS_SWMR_SADR2_Pos)                  /**< (TWIHS_SWMR) Slave Address 2 Mask */
#define TWIHS_SWMR_SADR2(value)               (TWIHS_SWMR_SADR2_Msk & ((value) << TWIHS_SWMR_SADR2_Pos))
#define TWIHS_SWMR_SADR3_Pos                  _U_(16)                                              /**< (TWIHS_SWMR) Slave Address 3 Position */
#define TWIHS_SWMR_SADR3_Msk                  (_U_(0x7F) << TWIHS_SWMR_SADR3_Pos)                  /**< (TWIHS_SWMR) Slave Address 3 Mask */
#define TWIHS_SWMR_SADR3(value)               (TWIHS_SWMR_SADR3_Msk & ((value) << TWIHS_SWMR_SADR3_Pos))
#define TWIHS_SWMR_DATAM_Pos                  _U_(24)                                              /**< (TWIHS_SWMR) Data Match Position */
#define TWIHS_SWMR_DATAM_Msk                  (_U_(0xFF) << TWIHS_SWMR_DATAM_Pos)                  /**< (TWIHS_SWMR) Data Match Mask */
#define TWIHS_SWMR_DATAM(value)               (TWIHS_SWMR_DATAM_Msk & ((value) << TWIHS_SWMR_DATAM_Pos))
#define TWIHS_SWMR_Msk                        _U_(0xFF7F7F7F)                                      /**< (TWIHS_SWMR) Register Mask  */


/* -------- TWIHS_FMR : (TWIHS Offset: 0x50) (R/W 32) FIFO Mode Register -------- */
#define TWIHS_FMR_TXRDYM_Pos                  _U_(0)                                               /**< (TWIHS_FMR) Transmitter Ready Mode Position */
#define TWIHS_FMR_TXRDYM_Msk                  (_U_(0x3) << TWIHS_FMR_TXRDYM_Pos)                   /**< (TWIHS_FMR) Transmitter Ready Mode Mask */
#define TWIHS_FMR_TXRDYM(value)               (TWIHS_FMR_TXRDYM_Msk & ((value) << TWIHS_FMR_TXRDYM_Pos))
#define   TWIHS_FMR_TXRDYM_ONE_DATA_Val       _U_(0x0)                                             /**< (TWIHS_FMR) TXRDY will be at level '1' when at least one data can be written in the Transmit FIFO  */
#define   TWIHS_FMR_TXRDYM_TWO_DATA_Val       _U_(0x1)                                             /**< (TWIHS_FMR) TXRDY will be at level '1' when at least two data can be written in the Transmit FIFO  */
#define   TWIHS_FMR_TXRDYM_FOUR_DATA_Val      _U_(0x2)                                             /**< (TWIHS_FMR) TXRDY will be at level '1' when at least four data can be written in the Transmit FIFO  */
#define TWIHS_FMR_TXRDYM_ONE_DATA             (TWIHS_FMR_TXRDYM_ONE_DATA_Val << TWIHS_FMR_TXRDYM_Pos) /**< (TWIHS_FMR) TXRDY will be at level '1' when at least one data can be written in the Transmit FIFO Position  */
#define TWIHS_FMR_TXRDYM_TWO_DATA             (TWIHS_FMR_TXRDYM_TWO_DATA_Val << TWIHS_FMR_TXRDYM_Pos) /**< (TWIHS_FMR) TXRDY will be at level '1' when at least two data can be written in the Transmit FIFO Position  */
#define TWIHS_FMR_TXRDYM_FOUR_DATA            (TWIHS_FMR_TXRDYM_FOUR_DATA_Val << TWIHS_FMR_TXRDYM_Pos) /**< (TWIHS_FMR) TXRDY will be at level '1' when at least four data can be written in the Transmit FIFO Position  */
#define TWIHS_FMR_RXRDYM_Pos                  _U_(4)                                               /**< (TWIHS_FMR) Receiver Ready Mode Position */
#define TWIHS_FMR_RXRDYM_Msk                  (_U_(0x3) << TWIHS_FMR_RXRDYM_Pos)                   /**< (TWIHS_FMR) Receiver Ready Mode Mask */
#define TWIHS_FMR_RXRDYM(value)               (TWIHS_FMR_RXRDYM_Msk & ((value) << TWIHS_FMR_RXRDYM_Pos))
#define   TWIHS_FMR_RXRDYM_ONE_DATA_Val       _U_(0x0)                                             /**< (TWIHS_FMR) RXRDY will be at level '1' when at least one unread data is in the Receive FIFO  */
#define   TWIHS_FMR_RXRDYM_TWO_DATA_Val       _U_(0x1)                                             /**< (TWIHS_FMR) RXRDY will be at level '1' when at least two unread data are in the Receive FIFO  */
#define   TWIHS_FMR_RXRDYM_FOUR_DATA_Val      _U_(0x2)                                             /**< (TWIHS_FMR) RXRDY will be at level '1' when at least four unread data are in the Receive FIFO  */
#define TWIHS_FMR_RXRDYM_ONE_DATA             (TWIHS_FMR_RXRDYM_ONE_DATA_Val << TWIHS_FMR_RXRDYM_Pos) /**< (TWIHS_FMR) RXRDY will be at level '1' when at least one unread data is in the Receive FIFO Position  */
#define TWIHS_FMR_RXRDYM_TWO_DATA             (TWIHS_FMR_RXRDYM_TWO_DATA_Val << TWIHS_FMR_RXRDYM_Pos) /**< (TWIHS_FMR) RXRDY will be at level '1' when at least two unread data are in the Receive FIFO Position  */
#define TWIHS_FMR_RXRDYM_FOUR_DATA            (TWIHS_FMR_RXRDYM_FOUR_DATA_Val << TWIHS_FMR_RXRDYM_Pos) /**< (TWIHS_FMR) RXRDY will be at level '1' when at least four unread data are in the Receive FIFO Position  */
#define TWIHS_FMR_TXFTHRES_Pos                _U_(16)                                              /**< (TWIHS_FMR) Transmit FIFO Threshold Position */
#define TWIHS_FMR_TXFTHRES_Msk                (_U_(0x3F) << TWIHS_FMR_TXFTHRES_Pos)                /**< (TWIHS_FMR) Transmit FIFO Threshold Mask */
#define TWIHS_FMR_TXFTHRES(value)             (TWIHS_FMR_TXFTHRES_Msk & ((value) << TWIHS_FMR_TXFTHRES_Pos))
#define TWIHS_FMR_RXFTHRES_Pos                _U_(24)                                              /**< (TWIHS_FMR) Receive FIFO Threshold Position */
#define TWIHS_FMR_RXFTHRES_Msk                (_U_(0x3F) << TWIHS_FMR_RXFTHRES_Pos)                /**< (TWIHS_FMR) Receive FIFO Threshold Mask */
#define TWIHS_FMR_RXFTHRES(value)             (TWIHS_FMR_RXFTHRES_Msk & ((value) << TWIHS_FMR_RXFTHRES_Pos))
#define TWIHS_FMR_Msk                         _U_(0x3F3F0033)                                      /**< (TWIHS_FMR) Register Mask  */


/* -------- TWIHS_FLR : (TWIHS Offset: 0x54) ( R/ 32) FIFO Level Register -------- */
#define TWIHS_FLR_TXFL_Pos                    _U_(0)                                               /**< (TWIHS_FLR) Transmit FIFO Level Position */
#define TWIHS_FLR_TXFL_Msk                    (_U_(0x3F) << TWIHS_FLR_TXFL_Pos)                    /**< (TWIHS_FLR) Transmit FIFO Level Mask */
#define TWIHS_FLR_TXFL(value)                 (TWIHS_FLR_TXFL_Msk & ((value) << TWIHS_FLR_TXFL_Pos))
#define TWIHS_FLR_RXFL_Pos                    _U_(16)                                              /**< (TWIHS_FLR) Receive FIFO Level Position */
#define TWIHS_FLR_RXFL_Msk                    (_U_(0x3F) << TWIHS_FLR_RXFL_Pos)                    /**< (TWIHS_FLR) Receive FIFO Level Mask */
#define TWIHS_FLR_RXFL(value)                 (TWIHS_FLR_RXFL_Msk & ((value) << TWIHS_FLR_RXFL_Pos))
#define TWIHS_FLR_Msk                         _U_(0x003F003F)                                      /**< (TWIHS_FLR) Register Mask  */


/* -------- TWIHS_FSR : (TWIHS Offset: 0x60) ( R/ 32) FIFO Status Register -------- */
#define TWIHS_FSR_TXFEF_Pos                   _U_(0)                                               /**< (TWIHS_FSR) Transmit FIFO Empty Flag (cleared on read) Position */
#define TWIHS_FSR_TXFEF_Msk                   (_U_(0x1) << TWIHS_FSR_TXFEF_Pos)                    /**< (TWIHS_FSR) Transmit FIFO Empty Flag (cleared on read) Mask */
#define TWIHS_FSR_TXFEF(value)                (TWIHS_FSR_TXFEF_Msk & ((value) << TWIHS_FSR_TXFEF_Pos))
#define TWIHS_FSR_TXFFF_Pos                   _U_(1)                                               /**< (TWIHS_FSR) Transmit FIFO Full Flag (cleared on read) Position */
#define TWIHS_FSR_TXFFF_Msk                   (_U_(0x1) << TWIHS_FSR_TXFFF_Pos)                    /**< (TWIHS_FSR) Transmit FIFO Full Flag (cleared on read) Mask */
#define TWIHS_FSR_TXFFF(value)                (TWIHS_FSR_TXFFF_Msk & ((value) << TWIHS_FSR_TXFFF_Pos))
#define TWIHS_FSR_TXFTHF_Pos                  _U_(2)                                               /**< (TWIHS_FSR) Transmit FIFO Threshold Flag (cleared on read) Position */
#define TWIHS_FSR_TXFTHF_Msk                  (_U_(0x1) << TWIHS_FSR_TXFTHF_Pos)                   /**< (TWIHS_FSR) Transmit FIFO Threshold Flag (cleared on read) Mask */
#define TWIHS_FSR_TXFTHF(value)               (TWIHS_FSR_TXFTHF_Msk & ((value) << TWIHS_FSR_TXFTHF_Pos))
#define TWIHS_FSR_RXFEF_Pos                   _U_(3)                                               /**< (TWIHS_FSR) Receive FIFO Empty Flag Position */
#define TWIHS_FSR_RXFEF_Msk                   (_U_(0x1) << TWIHS_FSR_RXFEF_Pos)                    /**< (TWIHS_FSR) Receive FIFO Empty Flag Mask */
#define TWIHS_FSR_RXFEF(value)                (TWIHS_FSR_RXFEF_Msk & ((value) << TWIHS_FSR_RXFEF_Pos))
#define TWIHS_FSR_RXFFF_Pos                   _U_(4)                                               /**< (TWIHS_FSR) Receive FIFO Full Flag Position */
#define TWIHS_FSR_RXFFF_Msk                   (_U_(0x1) << TWIHS_FSR_RXFFF_Pos)                    /**< (TWIHS_FSR) Receive FIFO Full Flag Mask */
#define TWIHS_FSR_RXFFF(value)                (TWIHS_FSR_RXFFF_Msk & ((value) << TWIHS_FSR_RXFFF_Pos))
#define TWIHS_FSR_RXFTHF_Pos                  _U_(5)                                               /**< (TWIHS_FSR) Receive FIFO Threshold Flag Position */
#define TWIHS_FSR_RXFTHF_Msk                  (_U_(0x1) << TWIHS_FSR_RXFTHF_Pos)                   /**< (TWIHS_FSR) Receive FIFO Threshold Flag Mask */
#define TWIHS_FSR_RXFTHF(value)               (TWIHS_FSR_RXFTHF_Msk & ((value) << TWIHS_FSR_RXFTHF_Pos))
#define TWIHS_FSR_TXFPTEF_Pos                 _U_(6)                                               /**< (TWIHS_FSR) Transmit FIFO Pointer Error Flag Position */
#define TWIHS_FSR_TXFPTEF_Msk                 (_U_(0x1) << TWIHS_FSR_TXFPTEF_Pos)                  /**< (TWIHS_FSR) Transmit FIFO Pointer Error Flag Mask */
#define TWIHS_FSR_TXFPTEF(value)              (TWIHS_FSR_TXFPTEF_Msk & ((value) << TWIHS_FSR_TXFPTEF_Pos))
#define TWIHS_FSR_RXFPTEF_Pos                 _U_(7)                                               /**< (TWIHS_FSR) Receive FIFO Pointer Error Flag Position */
#define TWIHS_FSR_RXFPTEF_Msk                 (_U_(0x1) << TWIHS_FSR_RXFPTEF_Pos)                  /**< (TWIHS_FSR) Receive FIFO Pointer Error Flag Mask */
#define TWIHS_FSR_RXFPTEF(value)              (TWIHS_FSR_RXFPTEF_Msk & ((value) << TWIHS_FSR_RXFPTEF_Pos))
#define TWIHS_FSR_Msk                         _U_(0x000000FF)                                      /**< (TWIHS_FSR) Register Mask  */


