Microchip-MPLAB-Harmony/csp/apps/spi/spi_ping_pong_with_dma/firmware/src/packs/ATSAMA5D27_DFP/component/twihs.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief TWIHS register API structure */
typedef struct
{
  __O   uint32_t                       TWIHS_CR;           /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       TWIHS_MMR;          /**< Offset: 0x04 (R/W  32) Master Mode Register */
  __IO  uint32_t                       TWIHS_SMR;          /**< Offset: 0x08 (R/W  32) Slave Mode Register */
  __IO  uint32_t                       TWIHS_IADR;         /**< Offset: 0x0C (R/W  32) Internal Address Register */
  __IO  uint32_t                       TWIHS_CWGR;         /**< Offset: 0x10 (R/W  32) Clock Waveform Generator Register */
  __I   uint8_t                        Reserved1[0x0C];
  __I   uint32_t                       TWIHS_SR;           /**< Offset: 0x20 (R/   32) Status Register */
  __O   uint32_t                       TWIHS_IER;          /**< Offset: 0x24 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       TWIHS_IDR;          /**< Offset: 0x28 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       TWIHS_IMR;          /**< Offset: 0x2C (R/   32) Interrupt Mask Register */
  __I   uint32_t                       TWIHS_RHR;          /**< Offset: 0x30 (R/   32) Receive Holding Register */
  __O   uint32_t                       TWIHS_THR;          /**< Offset: 0x34 ( /W  32) Transmit Holding Register */
  __IO  uint32_t                       TWIHS_SMBTR;        /**< Offset: 0x38 (R/W  32) SMBus Timing Register */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       TWIHS_ACR;          /**< Offset: 0x40 (R/W  32) Alternative Command Register */
  __IO  uint32_t                       TWIHS_FILTR;        /**< Offset: 0x44 (R/W  32) Filter Register */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint32_t                       TWIHS_SWMR;         /**< Offset: 0x4C (R/W  32) SleepWalking Matching Register */
  __IO  uint32_t                       TWIHS_FMR;          /**< Offset: 0x50 (R/W  32) FIFO Mode Register */
  __I   uint32_t                       TWIHS_FLR;          /**< Offset: 0x54 (R/   32) FIFO Level Register */
  __I   uint8_t                        Reserved4[0x08];
  __I   uint32_t                       TWIHS_FSR;          /**< Offset: 0x60 (R/   32) FIFO Status Register */
  __O   uint32_t                       TWIHS_FIER;         /**< Offset: 0x64 ( /W  32) FIFO Interrupt Enable Register */
  __O   uint32_t                       TWIHS_FIDR;         /**< Offset: 0x68 ( /W  32) FIFO Interrupt Disable Register */
  __I   uint32_t                       TWIHS_FIMR;         /**< Offset: 0x6C (R/   32) FIFO Interrupt Mask Register */
  __I   uint8_t                        Reserved5[0x60];
  __I   uint32_t                       TWIHS_DR;           /**< Offset: 0xD0 (R/   32) Debug Register */
  __I   uint8_t                        Reserved6[0x10];
  __IO  uint32_t                       TWIHS_WPMR;         /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       TWIHS_WPSR;         /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} twihs_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D2_TWIHS_COMPONENT_H_ */
